app/Controllers/GuardController.php

    public function guardList()
    {
        // Start the session
        $session = session();

        // Load guard and site models
        $guardModel = new GuardModel();
        $siteModel = new SiteModel();

        // Fetch guards and sites
        $data['listGuard'] = $guardModel->findAll();
        $data['listSite'] = $siteModel->where('status', 'Active')->findAll();
---
SELECT *
FROM `site`
WHERE `status` = 'Active'

                    if (!empty($ids[$index])) {
                        $guardEduBgModel->update($ids[$index], $dataEdu);
                    } else {
                        $guardEduBgModel->insert($dataEdu);
---
INSERT INTO `guardedubg` (`guardID`, `school`, `state`, `dateStart`, `dateTo`) VALUES ('JPS82', 'SMK Kuala Perlis', 'PERLIS', '', '')